<template>
  <div class="Phgl">
    <pre>
跑环材料攻略
在本文查询所需材料Ctrl+F 输入材料名
跑环材料经常飞地图推荐在商城购买:冒险岛任意门

跑环材料所需
药水类：
红色药水、橙色药水、白色药水、蓝色药水、活力神水、（明珠港等各大杂货店有售）超级药水（拍卖-游戏商店-杂货店）。
椅子类：
蓝色木椅 （拍卖-万能传送-城镇地图-明珠港防具店购买）

宠物指令类：
宠物指令：小猫系列、宠物指令：兔子系列、宠物指令：蝙蝠怪、宠物指令：小狗系列
拍卖-每日必做-每日跳跳

矿石类：
力量母矿、智慧母矿、敏捷母矿、幸运母矿、黑暗水晶母矿
拍卖-万能传送-刷矿圣地

怪物材料类：
蓝色蜗牛的壳 怪物：蓝蜗牛

飞龙的腮 怪物：蓝飞龙

飞龙的翅膀 怪物：红飞龙

飞龙的指甲 怪物：黑飞龙

花蘑菇盖 怪物：花蘑菇

蓝蘑菇盖 怪物：蓝蘑菇

绿蘑菇盖 怪物：绿蘑菇

蘑菇芽孢 怪物：蘑菇仔

怪猫的眼 怪物：怪猫（拍卖-万能传送-城镇地图-林中之城一直右走）

长枪牛魔王之角 怪物：长枪牛魔王（拍卖-万能传送-城镇地图-林中之城一直右走）

冰独眼兽之尾 怪物：冰独眼兽

红小丑之珠 怪物：红小丑

黄小丑的帽子 怪物：黄小丑

时之鬼兵的挂钟 怪物：时之鬼兵

时之鬼将的石片 怪物：时之鬼将

蓝帽海贼的舵 怪物：蓝帽海贼

大海贼王的帽子 怪物：大海贼王

僵尸娃娃 怪物：恶灵附身的娃娃

被封印的僵尸娃娃 怪物：死灵

海狮皮革 怪物：小海狮

虾肉 怪物：大龙虾

混种石块 怪物：混种石头人

刺蘑菇盖 怪物：刺蘑菇

企鹅王的嘴 怪物：企鹅王

白狼之尾 怪物：白狼

狼人脚趾甲 怪物：狼人

白狼人脚趾甲 怪物：白狼人

星光精灵的星块 怪物：星光精灵

玩具熊猫的棉花团 怪物：玩具棕熊

玩具熊猫的黄色丝带 怪物：玩具粉熊

熊猫娃娃 怪物：玩具熊猫

玩具小鸭 怪物：玩具鸭

木马骑兵的剑 怪物：木马骑兵

便宜的电池 怪物：女机器人

机器心脏 怪物：男机器人

冷冻鱼翅 怪物：尖鼻鲨鱼

石灰粉瓶 怪物：骨骸鱼

墨汁瓶 怪物：乌贼怪

变种侏儒怪的排笛 怪物：变种侏儒怪

半人马的火花 怪物：火焰半人马

半人马的净水 怪物：寒冰半人马

半人马的骨 怪物：暗黑半人马

橡木甲虫角 怪物：橡木甲虫

金属甲虫角 怪物：金属甲虫

哈维羽毛 怪物：哈维

小火花羽毛 怪物：血腥哈维

栗子 怪物：松松

顶针 怪物：豪猪

针包 怪物：灰豪猪

红蛇花 怪物：红花蛇

青蛇帽 怪物：青花蛇

蛇纹皮 怪物：青花蛇、红花蛇

蟠桃核 怪物：猿公

熊掌 怪物：棕熊

黄腰带 怪物：棕熊

红腰带 怪物：柔道熊猫

稻草玩偶 怪物：训练用稻草娃娃

瓦坛碎片 怪物：坛子

山参汤 怪物：山参坛子

桔梗 怪物：桔梗精

百年桔梗 怪物：老山参精

鳄鳄的皮 怪物：鳄鳄

海盗标志 怪物：克鲁

船长的帽子 怪物：凯丁

白纸张 怪物：秘籍

天书 怪物：秘籍

三叶草 怪物：母沙沙兔

胡萝卜 怪物：公沙沙兔

破旧的耳罩 怪物：耳罩壁虎

破旧的围巾 怪物：围巾壁虎

电线包 怪物：洛伊德、吉米拉

插头 怪物：氯化洛伊德、吉米拉

绿色衣襟 怪物：追忆的祭司

笑脸面具 怪物：追忆的神官、追忆的祭司

绿色头盔 怪物：追忆的守护兵

绿色心脏 怪物：追忆的守护队长

蓝色衣襟 怪物：后悔的祭司

望远镜 怪物：丁满

空袋子 怪物：沙漠矮人

钢铁碎片 怪物：螺母

５月的露水 怪物：哈闷气球

恶魔绵羊尾巴 怪物：恶魔绵羊

骷髅犬骨头 怪物：骷髅犬

绷带 怪物：木乃伊犬

肋骨 怪物：骷髅士兵

马头骨 怪物：骷髅指挥官

莱西毛球 怪物：莱西

怪物如何搜索：
使用商城购买的冒险岛任意门打开大地图，再右边搜索栏输入怪物名字。
      </pre>
  </div>
</template>

<script lang="ts">
import { Component, Vue } from "vue-property-decorator";

@Component
export default class Phgl extends Vue {
}
</script>
<style lang="scss" scoped>
</style>
